Конфигурация/InformationRegisters/СтатусыЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЛицензий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЛицензий/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда 
		КонтрольДублированияЛицензий(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольДублированияЛицензий(Отказ)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ЮрФизЛица"));
	МассивТипов.Добавить(Тип("Булево"));
	
	ТаблицаИсключений = Новый ТаблицаЗначений;
	ТаблицаИсключений.Колонки.Добавить("ЮрФизЛицо",		  Новый ОписаниеТипов(МассивТипов));
	ТаблицаИсключений.Колонки.Добавить("ВидДеятельности", Новый ОписаниеТипов("СправочникСсылка.ВидыДеятельности"));
	
	НовоеИсключение = ТаблицаИсключений.Добавить();
	НовоеИсключение.ВидДеятельности = Справочники.ВидыДеятельности.НаОсуществлениеСтраховойДеятельности;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИсключений", ТаблицаИсключений);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИсключений.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ТаблицаИсключений.ВидДеятельности КАК ВидДеятельности
		|ПОМЕСТИТЬ _ТаблицаИсключений
		|ИЗ
		|	&ТаблицаИсключений КАК ТаблицаИсключений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыЛицензийДействует.Лицензия.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СтатусыЛицензийДействует.Лицензия.ВидДеятельности КАК ВидДеятельности,
		|	СтатусыЛицензийДействует.Лицензия КАК Лицензия,
		|	СтатусыЛицензийДействует.Период КАК ДатаНачала,
		|	ЕСТЬNULL(МИНИМУМ(СтатусыЛицензийНЕДействует.Период), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания,
		|	АВТОНОМЕРЗАПИСИ() КАК Порядок
		|ПОМЕСТИТЬ _ПериодДействияЛицензий
		|ИЗ
		|	РегистрСведений.СтатусыЛицензий КАК СтатусыЛицензийДействует
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий КАК СтатусыЛицензийНЕДействует
		|		ПО СтатусыЛицензийДействует.Лицензия = СтатусыЛицензийНЕДействует.Лицензия
		|			И СтатусыЛицензийДействует.Период < СтатусыЛицензийНЕДействует.Период
		|			И (СтатусыЛицензийНЕДействует.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаИсключений КАК _ТаблицаИсключений
		|		ПО СтатусыЛицензийДействует.Лицензия.ВидДеятельности = _ТаблицаИсключений.ВидДеятельности
		|			И (СтатусыЛицензийДействует.Лицензия.ЮрФизЛицо = _ТаблицаИсключений.ЮрФизЛицо
		|				ИЛИ _ТаблицаИсключений.ЮрФизЛицо = НЕОПРЕДЕЛЕНО)
		|ГДЕ
		|	СтатусыЛицензийДействует.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|	И _ТаблицаИсключений.ЮрФизЛицо ЕСТЬ NULL
		|	И &ЭлементОтбора
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусыЛицензийДействует.Лицензия,
		|	СтатусыЛицензийДействует.Период,
		|	СтатусыЛицензийДействует.Лицензия.ЮрФизЛицо,
		|	СтатусыЛицензийДействует.Лицензия.ВидДеятельности
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЮрФизЛицо,
		|	ВидДеятельности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодДействияЛицензий.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_ПериодДействияЛицензий.ВидДеятельности КАК ВидДеятельности,
		|	_ПериодДействияЛицензий.Лицензия КАК Лицензия,
		|	_ПериодДействияЛицензий.ДатаНачала КАК ДатаНачала,
		|	_ПериодДействияЛицензий.ДатаОкончания КАК ДатаОкончания,
		|	_ПериодДействияДублейЛицензий.Лицензия КАК ЛицензияДубль,
		|	_ПериодДействияДублейЛицензий.ДатаНачала КАК ДатаНачалаДубля,
		|	_ПериодДействияДублейЛицензий.ДатаОкончания КАК ДатаОкончанияДубля
		|ИЗ
		|	_ПериодДействияЛицензий КАК _ПериодДействияЛицензий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодДействияЛицензий КАК _ПериодДействияДублейЛицензий
		|		ПО _ПериодДействияЛицензий.ВидДеятельности = _ПериодДействияДублейЛицензий.ВидДеятельности
		|			И _ПериодДействияЛицензий.ЮрФизЛицо = _ПериодДействияДублейЛицензий.ЮрФизЛицо
		|			И _ПериодДействияЛицензий.Порядок < _ПериодДействияДублейЛицензий.Порядок
		|			И _ПериодДействияЛицензий.Лицензия <> _ПериодДействияДублейЛицензий.Лицензия
		|			И (_ПериодДействияДублейЛицензий.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ _ПериодДействияЛицензий.ДатаНачала < _ПериодДействияДублейЛицензий.ДатаОкончания)
		|			И (_ПериодДействияЛицензий.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ _ПериодДействияЛицензий.ДатаОкончания > _ПериодДействияДублейЛицензий.ДатаНачала)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЮрФизЛицо";
#КонецОбласти		

	Запрос.УстановитьПараметр("ЭлементОтбора", Истина);
	
	Для Каждого ЭлементОтбора Из ЭтотОбъект.Отбор Цикл
		Если ЭлементОтбора.Имя = "Лицензия" И ЭлементОтбора.Использование Тогда
			Запрос.Текст = 
				СтрЗаменить(Запрос.Текст, "&ЭлементОтбора",
					"СтатусыЛицензийДействует.Лицензия.ЮрФизЛицо = &ЮрФизЛицо
					|	И СтатусыЛицензийДействует.Лицензия.ВидДеятельности = &ВидДеятельности");
			
			Запрос.УстановитьПараметр("ЮрФизЛицо",			ЭлементОтбора.Значение.ЮрФизЛицо);
			Запрос.УстановитьПараметр("ВидДеятельности",	ЭлементОтбора.Значение.ВидДеятельности);
		КонецЕсли;
	КонецЦикла;

	ФорматДаты = "ДФ=dd.MM.yyyy; ДП=' . . '";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Лицензия %1 юр.лица %2 (действует с %3 по %4) пересекается по периоду действия с лицензией %5 (действует с %6 по %7)",
				Выборка.Лицензия,
				Выборка.ЮрФизЛицо,
				Формат(Выборка.ДатаНачала, ФорматДаты),
				Формат(Выборка.ДатаОкончания, ФорматДаты),
				Выборка.ЛицензияДубль,
				Формат(Выборка.ДатаНачалаДубля, ФорматДаты),
				Формат(Выборка.ДатаОкончанияДубля, ФорматДаты)), Выборка.Лицензия,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
